Repository: silbersteine/cSharpLocalization
Catalog: cSharpLocalization/LangResources/lang.*.resx
Languages: de_de, es_es, fr_fr

# coldTemp
source: Wow! {0} degrees Fahrernheit! That's freezing!!!
de_de: Wow! {0} Grad Fahrernheit! Das ist eiskalt!!!
es_es: ¡Guau! ¡ {0} grados Fahrernheit! ¡¡¡Eso está helado!!!
fr_fr: Ouah! {0} degrés Fahrenheit ! C'est glacial !!!

# coolTemp
source: Okay, {0} degrees Fahrernheit isn't exactly warm. Don't forget a coat!
de_de: Okay, {0} Grad Fahrernheit ist nicht gerade warm. Mantel nicht vergessen!
es_es: De acuerdo, {0} grados Fahrernheit no es exactamente cálido. ¡No olvides un abrigo!
fr_fr: D'accord, {0} degrés Fahrenheit ne sont pas exactement chauds. N'oubliez pas un manteau !

# currentTemp
source: What is the temperature in Fahrenheit where you're at, right now? Quick! It's urgent!
de_de: Wie hoch ist die Temperatur in Fahrenheit, wo du dich gerade befindest? Schnell! Es ist dringend!
es_es: ¿Cuál es la temperatura en Fahrenheit donde estás ahora mismo? ¡Rápido! ¡Es urgente!
fr_fr: Dis-moi la température en Fahrenheit où tu es, en ce moment ? Rapide! C'est urgent!

# firstName
source: What is your first name?
de_de: Wie lautet dein Vorname?
es_es: ¿Cuál es tu primer nombre?
fr_fr: Quel est votre prénom?

# goodbye
source: Goodbye {0} {1}
de_de: Auf Wiedersehen {0} {1}
es_es: Adiós {0} {1}
fr_fr: Au revoir {0} {1}

# greetAfternoon
source: Good afternoon. Hit any key to continue
de_de: Guten Tag. Drücken Sie eine beliebige Taste, um fortzufahren
es_es: Buenas tardes. Presiona cualquier tecla para continuar
fr_fr: Bon après-midi. Appuyez sur n'importe quelle touche pour continuer

# greetEvening
source: Good evening. Hit any key to continue
de_de: Guten Abend. Drücken Sie eine beliebige Taste, um fortzufahren
es_es: Buenas noches. Presiona cualquier tecla para continuar
fr_fr: Bonne soirée. Appuyez sur n'importe quelle touche pour continuer

# greetMorning
source: Good morning. Hit any key to continue
de_de: Guten Morgen. Drücken Sie eine beliebige Taste, um fortzufahren
es_es: Buen día. Presiona cualquier tecla para continuar
fr_fr: Bonjour. Appuyez sur n'importe quelle touche pour continuer

# greeting
source: Hello {0} {1}
de_de: Hallo {0} {1}
es_es: Hola {0} {1}
fr_fr: Bonjour {0} {1}

# hotTemp
source: OMG!!! {0} degrees Fahrernheit is way too hot! Stay indoors!!!
de_de: OMG!!! {0} Grad Fahrernheit ist viel zu heiß! Bleib drinnen!!!
es_es: ¡¡¡DIOS MÍO!!! ¡ {0} grados Fahrernheit hace demasiado calor! ¡¡¡Quedate adentro!!!
fr_fr: OH MON DIEU!!! Il fait bien trop chaud à {0} degrés Fahrenheit ! Reste à l'intérieur!!!

# isoError0
source: You didn't write anything. Try again. Choose from en-US, es-ES, fr-FR, de-DE.
de_de: Ich wusste, dass du aufhören würdest. Weichei!
es_es: Sabía que renunciarías. ¡Endeble!
fr_fr: Je savais que tu abandonnerais. Mauviette!

# isoError1
source: Nice try but you got it wrong. Try again. Choose from en-US, es-ES, fr-FR, de-DE.
de_de: Netter Versuch, aber du hast es falsch verstanden. Versuchen Sie es erneut. Wählen Sie aus en-US, es-ES, fr-FR, de-DE.
es_es: Buen intento pero te equivocaste. Intentar otra vez. Elija entre en-US, es-ES, fr-FR, de-DE.
fr_fr: Bien essayé mais tu t'es trompé. Essayer à nouveau. Choisissez entre en-US, es-ES, fr-FR, de-DE.

# isoPrompt
source: Select a language by writing its ISO code. Choose from en-US, es-ES, fr-FR, de-DE
de_de: Wählen Sie eine Sprache aus, indem Sie ihren ISO-Code eingeben, oder drücken Sie zum Beenden die ENTER. Wählen Sie aus en-US, es-ES, fr-FR, de-DE
es_es: Seleccione un idioma escribiendo su código ISO o presione ENTER para salir. Elija entre en-US, es-ES, fr-FR, de-DE
fr_fr: Sélectionnez une langue en écrivant son code ISO ou appuyez sur ENTER pour quitter. Choisissez entre en-US, es-ES, fr-FR, de-DE

# isoSuccess
source: You chose {0}.
de_de: Sie haben {0} gewählt.
es_es: Has elegido {0} .
fr_fr: Vous avez choisi {0} .

# lastName
source: What is your last name?
de_de: Was ist dein Nachname?
es_es: ¿Cual es tu apellido?
fr_fr: Dites-moi votre nom de famille ?

# nameError
source: Try again! Write your name once more
de_de: Versuchen Sie es erneut! Schreiben Sie noch einmal Ihren Namen
es_es: ¡Intentar otra vez! Escribe tu nombre una vez más
fr_fr: Essayer à nouveau! Écrivez votre nom une fois de plus

# reject
source: I didn't want to do it anyay.
de_de: Ich wollte es sowieso nicht machen.
es_es: Yo no quería hacerlo de todos modos.
fr_fr: Je ne voulais pas le faire de toute façon.

# tempConv
source: Temperatures don't sound as extreme when converted to Celsius. Would you like me to convert the temperature to Celsius? Write Y for YES and N for NO.
de_de: Temperaturen klingen nicht so extrem, wenn man sie in Celsius umrechnet. Soll ich die Temperatur in Celsius umrechnen? Schreiben Sie Y für JA und N für NEIN.
es_es: Las temperaturas no suenan tan extremas cuando se convierten a Celsius. ¿Quieres que convierta la temperatura a Celsius? Escriba Y para SÍ y N para NO.
fr_fr: Les températures ne semblent pas aussi extrêmes lorsqu'elles sont converties en degrés Celsius. Voulez-vous que je convertisse la température en degrés Celsius ? Écrivez Y pour OUI et N pour NON.

# tempConvResults
source: {0} degrees Fahreinheit = {1} degrees Celcius
de_de: {0} Grad Fahreinheit = {1} Grad Celsius
es_es: {0} grados Fahreinheit = {1} grados Celsius
fr_fr: {0} degrés Fahreinheit = {1} degrés Celsius

# tempNews
source: Hit ENTER for good news.
de_de: Drücken Sie ENTER für gute Neuigkeiten.
es_es: Presiona ENTER para buenas noticias.
fr_fr: Appuyez sur ENTER pour de bonnes nouvelles.

# warmTemp
source: {0} degrees Fahrernheit. That's quite warm. Don't forget your sunscreen!
de_de: {0} Grad Fahrernheit. Das ist ziemlich warm. Vergessen Sie Ihre Sonnencreme nicht!
es_es: {0} grados Fahrernheit. Eso es bastante cálido. ¡No olvides tu protector solar!
fr_fr: {0} degrés Fahrenheit. C'est bien chaleureux. N'oubliez pas votre crème solaire !
